Котельников_АБ_70153995/src/Documents/ПроведениеТестирования/ПроведениеТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеТестирования</name>
  <basedOn>Document.ПроведениеСобеседования</basedOn>
  <registerRecords>AccumulationRegister.ОценкиКандидатов</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПроведениеСобеседования</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>АнкетаВопросов</name>
    <type>
      <types>CatalogRef.Анкеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяОценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВопросов</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветКандидата</name>
      <type>
        <types>EnumRef.ТипыОценкиОтвета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/AccumulationRegisters/ОценкиКандидатов/ОценкиКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОценкиКандидатов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Анкета</name>
    <type>
      <types>CatalogRef.Анкеты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Котельников_АБ_70153995/src/Documents/ПроведениеТестирования/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОценкиКандидатов 
	Движения.ОценкиКандидатов.Записывать = Истина;
	Движение = Движения.ОценкиКандидатов.Добавить();
	Движение.Период = Дата;
	Движение.Вакансия = Вакансия;
	Движение.Кандидат = Кандидат;
	Движение.Анкета = АнкетаВопросов;
	Движение.Оценка = ОбщаяОценка;

КонецПроцедуры
